src/toir_cfe/src/InformationRegisters/торо_ОбщиеДанныеПоРемонтам/торо_ОбщиеДанныеПоРемонтам.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension" extendedConfigurationObject="1b8fbeca-59ee-4207-b4da-c1fdb926cf07">
  <name>торо_ОбщиеДанныеПоРемонтам</name>
  <objectBelonging>Adopted</objectBelonging>
  <extension>
    <informationRegisterPeriodicity>Checked</informationRegisterPeriodicity>
    <writeMode>Checked</writeMode>
  </extension>
  <resources extendedConfigurationObject="ca7de41a-4380-42d3-b93b-3d14a13ce3d9">
    <name>ВидРемонта</name>
    <objectBelonging>Adopted</objectBelonging>
  </resources>
  <resources extendedConfigurationObject="a534769e-5beb-4b57-b3af-d138e38afe8e">
    <name>ЕстьЗаявка</name>
    <objectBelonging>Adopted</objectBelonging>
  </resources>
  <resources extendedConfigurationObject="e320ae57-9da9-47dd-9d22-4265d1574beb">
    <name>ЕстьНаряд</name>
    <objectBelonging>Adopted</objectBelonging>
  </resources>
  <resources extendedConfigurationObject="26632482-bdd2-4881-af87-d856096d8d30">
    <name>ЕстьАкт</name>
    <objectBelonging>Adopted</objectBelonging>
  </resources>
  <resources extendedConfigurationObject="d55a38b3-ccd6-42d5-ae8f-6fe7a5e3b7e3">
    <name>ЕстьАктПриемки</name>
    <objectBelonging>Adopted</objectBelonging>
  </resources>
  <resources extendedConfigurationObject="f7d027da-099e-47c1-b6c6-76397094ed0e">
    <name>Отменен</name>
    <objectBelonging>Adopted</objectBelonging>
  </resources>
  <resources extendedConfigurationObject="646d6d26-3edf-4e80-88ae-f94e1a83e51d">
    <name>Завершен</name>
    <objectBelonging>Adopted</objectBelonging>
  </resources>
  <resources extendedConfigurationObject="760d81bf-833c-42a4-8d1e-f2df012d64e5">
    <name>Замещен</name>
    <objectBelonging>Adopted</objectBelonging>
  </resources>
  <attributes extendedConfigurationObject="ba85eb5c-9b6e-4b48-91c7-27de33dd2f16">
    <name>ВидДокументаНачалаЦепочки</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="088d9db2-1a15-4bff-99d4-26bc08da07cd">
    <name>ОбъектРемонта</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <dimensions extendedConfigurationObject="8d7e3dc7-96eb-4e67-9634-d1e75420b4bb">
    <name>IDРемонта</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <stringQualifiers>
          <length>36</length>
        </stringQualifiers>
      </typeExtension>
    </extension>
  </dimensions>
  <dimensions extendedConfigurationObject="60e67476-1608-4996-b48f-ffa74f993732">
    <name>Организация</name>
    <objectBelonging>Adopted</objectBelonging>
  </dimensions>
  <dimensions extendedConfigurationObject="332898fd-fb46-4e34-af0e-1450d855fac1">
    <name>ПодразделениеИнициатор</name>
    <objectBelonging>Adopted</objectBelonging>
  </dimensions>
  <dimensions extendedConfigurationObject="442326ff-0b99-4a6d-81af-fa819b4a7b89">
    <name>ДокументНачалаЦепочки</name>
    <objectBelonging>Adopted</objectBelonging>
  </dimensions>
</mdclass:InformationRegister>

src/toir_cfe/src/Enums/торо_СтатусыОРВУчете/торо_СтатусыОРВУчете.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension" extendedConfigurationObject="8c768089-c81b-4fca-9682-7d4b5123d5d3">
  <name>торо_СтатусыОРВУчете</name>
  <objectBelonging>Adopted</objectBelonging>
  <enumValues extendedConfigurationObject="a8daacfd-1cec-4806-9a64-930354778f34">
    <name>ПринятоКУчету</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues extendedConfigurationObject="72855c5a-3ce9-4424-b0fe-175d50fbcaca">
    <name>НеПринятоКУчету</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
</mdclass:Enum>

src/toir_cfe/src/Enums/торо_ВидыДокументовНачалаЦепочкиРемонтов/торо_ВидыДокументовНачалаЦепочкиРемонтов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension" extendedConfigurationObject="9a4a271c-3df6-45ca-a18a-c3a215a23313">
  <name>торо_ВидыДокументовНачалаЦепочкиРемонтов</name>
  <objectBelonging>Adopted</objectBelonging>
  <enumValues extendedConfigurationObject="567a12d3-c608-43f0-a336-d5f773d2a52a">
    <name>ВнешнееОснованиеДляРабот</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues extendedConfigurationObject="71d3ac2c-00e7-4f96-8907-382131bb091a">
    <name>ВыявленныйДефект</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues extendedConfigurationObject="567318ad-fa36-4a40-8027-655e8c8f1c0b">
    <name>ПланГрафикППР</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues extendedConfigurationObject="dddfb2af-bfea-4ecb-bce9-f89ad241fcdb">
    <name>ГрафикРегламентныхМероприятий</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
</mdclass:Enum>

src/toir_cfe/src/CommonModules/торо_ЗаполнениеДокументов/Module.bsl
&ИзменениеИКонтроль("торо_ЗаменитьПрефиксВДокументеПередЗаписью")
Процедура проф_торо_ЗаменитьПрефиксВДокументеПередЗаписью(Источник, Отказ, РежимЗаписи, РежимПроведения)

	#Вставка
	//++ Проф-ИТ, #163, Соловьев А.А., 25.08.2023
	Если Источник.ОбменДанными.Загрузка Тогда 
		Возврат;
	КонецЕсли;	
	//-- Проф-ИТ, #163, Соловьев А.А., 25.08.2023
	#КонецВставки
	Если Источник.Номер = "" Тогда 
		Возврат; // Это новый документ, номер и так будет установлен правильно.
	КонецЕсли; 

	СтруктураСвойств = Новый Структура("Организация");
	ЗаполнитьЗначенияСвойств(СтруктураСвойств, Источник);

	Если СтруктураСвойств.Организация <> Неопределено Тогда

		Если Источник.Организация = Источник.Ссылка.Организация Тогда 
			Возврат; // Организация не изменилась.
		КонецЕсли; 

		НомерДок = Источник.Номер;
		Позиция = СтрНайти(НомерДок, "-");
		Если Позиция > 3 Тогда	
			// Номер не соответствует шаблону (скорее всего вводился руками).
			Возврат; 
		КонецЕсли; 

		Префикс = ПолучитьПрефиксОрганизации(СтруктураСвойств.Организация);
		Источник.УстановитьНовыйНомер(Префикс);

	КонецЕсли;

КонецПроцедуры

//++ Проф-ИТ, #98, Башинская А.Ю., 14.09.2023

// Представление наименования ОР исходя из кастроек константы "торо_ПредставлениеОРДляПечати".
//
// Параметры:
//  ОбъектРемонта - СправочникСсылка.торо_ОбъектыРемонта - объект ремонта.
//
// Возвращаемое значение:
//  Строка - представление для печати.
//
Функция проф_ПолучитьПредоставленияОРДляПечати(ОбъектРемонта) Экспорт 
	
	СтрОбъектРемонта = "ОбъектРемонта";
	ПредставлениеОбъектаРемонта = Неопределено;
	
	Попытка					
		ПредставлениеОбъектаРемонта = проф_ПредставлениеОбъектаОР(ОбъектРемонта);		
	Исключение
		#Если Клиент Тогда
			ИнформацияОбОшибке = ИнформацияОбОшибке();
			ПоказатьПредупреждение(Неопределено, ИнформацияОбОшибке.Причина.Описание);
		#КонецЕсли
	КонецПопытки;
	
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	МАКСИМУМ(ВЫБОР
	               |			КОГДА торо_СтатусыОбъектовРемонтаВУчете.СтатусОР = ЗНАЧЕНИЕ(Перечисление.торо_СтатусыОРВУчете.ПринятоКУчету)
	               |				ТОГДА торо_СтатусыОбъектовРемонтаВУчете.Период
	               |		КОНЕЦ) КАК ДатаПринятияКУчету,
	               |	МАКСИМУМ(ВЫБОР
	               |			КОГДА торо_СтатусыОбъектовРемонтаВУчете.СтатусОР = ЗНАЧЕНИЕ(Перечисление.торо_СтатусыОРВУчете.СнятоСУчета)
	               |				ТОГДА торо_СтатусыОбъектовРемонтаВУчете.Период
	               |		КОНЕЦ) КАК ДатаСнятияСУчета,
	               |	торо_СтатусыОбъектовРемонтаВУчете.ОбъектРемонта КАК ОбъектРемонта
	               |ПОМЕСТИТЬ ПоследниеДатыСтатусов
	               |ИЗ
	               |	РегистрСведений.торо_СтатусыОбъектовРемонтаВУчете КАК торо_СтатусыОбъектовРемонтаВУчете
	               |ГДЕ
	               |	торо_СтатусыОбъектовРемонтаВУчете.ОбъектРемонта = &ОбъектРемонта
	               |
	               |СГРУППИРОВАТЬ ПО
	               |	торо_СтатусыОбъектовРемонтаВУчете.ОбъектРемонта
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	ПоследниеДатыСтатусов.ОбъектРемонта КАК ОбъектРемонта,
	               |	торо_СтатусыОбъектовРемонтаВУчете.Период КАК ДатаВводаВЭксплуатацию,
	               |	торо_СтатусыОбъектовРемонтаВУчете.Регистратор КАК РегистраторПринятияКУчету,
	               |	ВЫБОР
	               |		КОГДА НЕ ПоследниеДатыСтатусов.ДатаСнятияСУчета ЕСТЬ NULL 
	               |				И ПоследниеДатыСтатусов.ДатаПринятияКУчету < ПоследниеДатыСтатусов.ДатаСнятияСУчета
	               |			ТОГДА торо_СтатусыОбъектовРемонтаВУчете1.Период
	               |		ИНАЧЕ ДАТАВРЕМЯ(1, 1, 1)
	               |	КОНЕЦ КАК ДатаСнятияСУчета,
	               |	ВЫБОР
	               |		КОГДА НЕ ПоследниеДатыСтатусов.ДатаСнятияСУчета ЕСТЬ NULL 
	               |				И ПоследниеДатыСтатусов.ДатаПринятияКУчету < ПоследниеДатыСтатусов.ДатаСнятияСУчета
	               |			ТОГДА торо_СтатусыОбъектовРемонтаВУчете1.Регистратор
	               |		ИНАЧЕ ЗНАЧЕНИЕ(Документ.торо_ВыбытиеОбъектаРемонта.ПустаяСсылка)
	               |	КОНЕЦ КАК РегистраторСнятияСУчета
	               |ИЗ
	               |	ПоследниеДатыСтатусов КАК ПоследниеДатыСтатусов
	               |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.торо_СтатусыОбъектовРемонтаВУчете КАК торо_СтатусыОбъектовРемонтаВУчете
	               |		ПО ПоследниеДатыСтатусов.ДатаПринятияКУчету = торо_СтатусыОбъектовРемонтаВУчете.Период
	               |			И ПоследниеДатыСтатусов.ОбъектРемонта = торо_СтатусыОбъектовРемонтаВУчете.ОбъектРемонта
	               |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.торо_СтатусыОбъектовРемонтаВУчете КАК торо_СтатусыОбъектовРемонтаВУчете1
	               |		ПО ПоследниеДатыСтатусов.ДатаСнятияСУчета = торо_СтатусыОбъектовРемонтаВУчете1.Период
	               |			И ПоследниеДатыСтатусов.ОбъектРемонта = торо_СтатусыОбъектовРемонтаВУчете1.ОбъектРемонта";
	
	Запрос.УстановитьПараметр(СтрОбъектРемонта, ОбъектРемонта);
	Запрос.УстановитьПараметр("ТекущаяДата",   ТекущаяДатаСеанса());
	Результат = Запрос.Выполнить();
	ДатаСнятияСУчета = Дата(1, 1, 1);
	Если Не Результат.Пустой() Тогда  
		Выборка = Результат.Выбрать();
		Выборка.Следующий();
		ДатаСнятияСУчета = Выборка.ДатаСнятияСУчета;
	КонецЕсли;
	
	Запрос = Новый Запрос();
	Запрос.Текст = 
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ЕСТЬNULL(торо_ТекущееСостояниеОРСрезПоследних.ВидЭксплуатации, ЗНАЧЕНИЕ(Справочник.торо_ВидыЭксплуатации.ПустаяСсылка)) КАК ВидЭксплуатации
	|ИЗ
	|	РегистрСведений.торо_ТекущееСостояниеОР.СрезПоследних(&ТекущаяДата, ОбъектРемонта = &ОбъектРемонта) КАК торо_ТекущееСостояниеОРСрезПоследних";
	Запрос.УстановитьПараметр(СтрОбъектРемонта, ОбъектРемонта);
	Запрос.УстановитьПараметр("ТекущаяДата", ТекущаяДатаСеанса());
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Заголовок1 = "";
	Если Выборка.Следующий() И НЕ ЗначениеЗаполнено(ДатаСнятияСУчета) Тогда
		Если Выборка.ВидЭксплуатации = Справочники.торо_ВидыЭксплуатации.ПустаяСсылка() Тогда
			Заголовок1 = Заголовок1 + НСтр("ru = ' [Вид эксплуатации не установлен]'");
		Иначе
			Заголовок1 = Заголовок1 + " [" + Выборка.ВидЭксплуатации + "]";
		КонецЕсли;
	КонецЕсли;
	
	Запрос = Новый Запрос();
	Запрос.Текст = "ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	торо_ОбщиеДанныеПоРемонтам.ЕстьНаряд КАК ЕстьНаряд,
		|	торо_ОбщиеДанныеПоРемонтам.ОбъектРемонта КАК ОбъектРемонта
		|ПОМЕСТИТЬ ВтОбщиеДанныеПоРемонтам
		|ИЗ
		|	РегистрСведений.торо_ОбщиеДанныеПоРемонтам КАК торо_ОбщиеДанныеПоРемонтам
		|ГДЕ
		|	торо_ОбщиеДанныеПоРемонтам.ОбъектРемонта = &ОбъектРемонта
		|	И торо_ОбщиеДанныеПоРемонтам.Завершен = ЛОЖЬ
		|	И торо_ОбщиеДанныеПоРемонтам.ЕстьНаряд = ИСТИНА
		|	И торо_ОбщиеДанныеПоРемонтам.Отменен = ЛОЖЬ
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	торо_ОбщиеДанныеПоРемонтам.ЕстьНаряд,
		|	торо_ОбщиеДанныеПоРемонтам.ОбъектРемонта
		|ИЗ
		|	РегистрСведений.торо_ОбщиеДанныеПоРемонтам КАК торо_ОбщиеДанныеПоРемонтам
		|ГДЕ
		|	торо_ОбщиеДанныеПоРемонтам.ОбъектРемонта = &ОбъектРемонта
		|	И торо_ОбщиеДанныеПоРемонтам.Завершен = ЛОЖЬ
		|	И торо_ОбщиеДанныеПоРемонтам.ЕстьНаряд = ЛОЖЬ
		|			И торо_ОбщиеДанныеПоРемонтам.ВидДокументаНачалаЦепочки = ЗНАЧЕНИЕ(Перечисление.торо_ВидыДокументовНачалаЦепочкиРемонтов.ВыявленныйДефект)
		|	И торо_ОбщиеДанныеПоРемонтам.Отменен = ЛОЖЬ
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	МАКСИМУМ(ВтОбщиеДанныеПоРемонтам.ЕстьНаряд) КАК ЕстьНаряд
		|ИЗ
		|	ВтОбщиеДанныеПоРемонтам КАК ВтОбщиеДанныеПоРемонтам
		|
		|СГРУППИРОВАТЬ ПО
		|	ВтОбщиеДанныеПоРемонтам.ОбъектРемонта";	
	
		
	Запрос.УстановитьПараметр(СтрОбъектРемонта, ОбъектРемонта);
	Выборка = Запрос.Выполнить().Выбрать();  
	Заголовок2 = "";
	Если Выборка.Следующий() Тогда
		Если Выборка.ЕстьНаряд = 1 Тогда
			Заголовок2 = Заголовок2 + НСтр("ru = ' [Выполняется ремонт]'");
		Иначе
			Заголовок2 = Заголовок2 + НСтр("ru = ' [Выявлен дефект]'");
		КонецЕсли;			
	КонецЕсли;
    ПредставлениеОбъектаРемонта = ПредставлениеОбъектаРемонта + " " + Заголовок1 + Заголовок2;
	
	Возврат ПредставлениеОбъектаРемонта;
	
КонецФункции

Функция проф_ПредставлениеОбъектаОР(ОбъектРемонта)
	
	ЗначениеКонстантыОР = Константы.торо_НаименованиеОРДляПечати.Получить();
		
	Если НЕ ЗначениеЗаполнено(ЗначениеКонстантыОР)
	ИЛИ ЗначениеКонстантыОР = Перечисления.торо_ПредставлениеОРДляПечати.НаименованиеОР Тогда
		Возврат СокрЛП(ОбъектРемонта);
	КонецЕсли;	
		
	Если ЗначениеКонстантыОР = Перечисления.торо_ПредставлениеОРДляПечати.НаименованиеОР_КодОР Тогда
		Возврат СокрЛП(ОбъектРемонта) + " (" + СокрЛП(ОбъектРемонта.Код) +")";
	КонецЕсли;	
		
	Если ЗначениеКонстантыОР = Перечисления.торо_ПредставлениеОРДляПечати.НаименованиеОР_ИнвНомОР Тогда
		Возврат СокрЛП(ОбъектРемонта) + " (" + СокрЛП(ОбъектРемонта.ИнвентарныйНомер) +")";
	КонецЕсли;
	
	Если ЗначениеКонстантыОР = Перечисления.торо_ПредставлениеОРДляПечати.ПолноеНаименованиеОР Тогда
		Возврат торо_РаботаСИерархией20.ПолноеНаименованиеОР(ОбъектРемонта);
	КонецЕсли;	
		
	Если ЗначениеКонстантыОР = Перечисления.торо_ПредставлениеОРДляПечати.НаименованиеОР_ТехнНомОР Тогда
		Возврат СокрЛП(ОбъектРемонта) + " (" + СокрЛП(ОбъектРемонта.ТехНомер) +")";
	КонецЕсли;	
		
	Если ЗначениеКонстантыОР = Перечисления.торо_ПредставлениеОРДляПечати.КакВСистеме Тогда 
		Возврат СокрЛП(ОбъектРемонта);
	КонецЕсли;	
	
КонецФункции	

//-- Проф-ИТ, #98, Башинская А.Ю., 14.09.2023
